//////////////////////////////////////////////////////////////
// Windows 의 콘솔 화면에서 커서 제어.
//
//////////////////////////////////////////////////////////////
#ifndef __CONSOLE__
#define __CONSOLE__
enum class CONSOLE_COLOR
{
	DEFAULT=8,
	GREEN=10,
	SKY=11,
	RED=12,
	PINK=13,
	YELLOW=14,
	WHITE=15
};
//-------------------------------------------------------------
// 콘솔 제어를 위한 준비 작업.
//
//-------------------------------------------------------------
void cs_Initial(void);


//-------------------------------------------------------------
// 콘솔 화면의 커서를 X, Y 좌표로 이동시킨다.
//
//-------------------------------------------------------------
void cs_MoveCursor(int iPosX, int iPosY);

void cs_SetColor(CONSOLE_COLOR color);


#endif

